app/views/carts/_cart.html.erb

<% if @user.items.empty? %>
---
SELECT  1 AS one FROM "items" INNER JOIN "shopping_carts" ON "items"."id" = "shopping_carts"."item_id" WHERE "shopping_carts"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT "items".* FROM "items" INNER JOIN "shopping_carts" ON "items"."id" = "shopping_carts"."item_id" WHERE "shopping_carts"."user_id" = $1  [["user_id", 1]]