app/controllers/carts_controller.rb

  def add_item
    item = Item.find(params[:item_id])
    quantity_in_stock = item.quantity
    quantity_in_cart = current_user.shopping_carts.where(item_id: params[:item_id]).count
    if quantity_in_cart < quantity_in_stock
      current_user.shopping_carts.create(item_id: params[:item_id])
      if request.xhr?
        render :text => current_user.items.count
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 AND "shopping_carts"."item_id" = $2  [["user_id", 1], ["item_id", 1]]
INSERT INTO "shopping_carts" ("item_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 1], ["user_id", 1], ["created_at", "2016-01-22 02:32:26.735866"], ["updated_at", "2016-01-22 02:32:26.735866"]]
SELECT COUNT(*) FROM "items" INNER JOIN "shopping_carts" ON "items"."id" = "shopping_carts"."item_id" WHERE "shopping_carts"."user_id" = $1  [["user_id", 1]]

  def remove_item
    item_to_remove = current_user.shopping_carts.where(item_id: params[:item_id], user_id: current_user.id).first
    item_to_remove.destroy
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 AND "shopping_carts"."item_id" = $2 AND "shopping_carts"."user_id" = $3  ORDER BY "shopping_carts"."id" ASC LIMIT 1  [["user_id", 1], ["item_id", 1], ["user_id", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]
DELETE FROM "shopping_carts" WHERE "shopping_carts"."id" = $1  [["id", 1]]

  def clear_cart
    current_user.shopping_carts.each(&:destroy)
---
SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1  [["user_id", 1]]