app/controllers/items_controller.rb

  def index
    @items = Item.order(:created_at)
---
SELECT "items".* FROM "items"  ORDER BY "items"."created_at" ASC

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "description", "quantity", "picture_url", "upc", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 21]]
UPDATE "items" SET "quantity" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["quantity", 15], ["updated_at", "2016-01-22 22:23:55.018403"], ["id", 1]]