app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."created_at" ASC
---
  def index
    redirect_to '/' unless current_user && current_user.is_admin?
    @users = User.order(:created_at)

INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.password = params[:password_plaintext]
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", 1], ["updated_at", "2016-01-21 19:28:52.719377"], ["id", 2]]
---
  def make_admin
    redirect_to '/' unless current_user && current_user.is_admin?
    @user = User.find(params[:id])
    @user.update(user_type: 1)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", 0], ["updated_at", "2016-01-21 19:28:54.613824"], ["id", 2]]
---
  def make_customer
    redirect_to '/' unless current_user && current_user.is_admin?
    @user = User.find(params[:id])
    @user.update(user_type: 0)