app/views/layouts/_nav.html.erb

SELECT COUNT(*) FROM "items" INNER JOIN "shopping_carts" ON "items"."id" = "shopping_carts"."item_id" WHERE "shopping_carts"."user_id" = $1  [["user_id", 1]]
---
      <form class="navbar-form navbar-right" action="<%=  %>">
        <a href="/cart" class="btn btn-primary btn-success cart-button" data-toggle="modal" data-target="#shopping-cart"><span class="glyphicon glyphicon-shopping-cart"></span> Cart <span class="badge cart-count"><%= current_user.items.count %></span></a>